#include <iostream>
#include <stack>
using namespace std;
int main() {
    stack<int> S; // Стек для зберігання цілих чисел
    int sum = 0; // Змінна для підрахунку суми
    int n; // Змінна для розміру стека
    // Запитати у користувача розмір стека
    cout << "Введіть розмір стека: ";
    cin >> n;
    // Додати елементи до стека
    cout << "Введіть " << n << " цілих чисел:" << endl;
    for (int i = 0; i < n; i++) {
        int num;
        cin >> num; // Ввести число
        S.push(num); // Додати число до стека
    }
    
    // Витягніть всі числа з стека та обчисліть суму
    cout << "Елементи стека: ";
    while (!S.empty()) {
        int num = S.top(); // Отримати верхній елемент
        cout << num << " "; // Вивести число
        sum += num; // Додати до суми
        S.pop(); // Видалити верхній елемент
    }
    
    cout << "\nСума чисел: " << sum << endl;
    
    return 0;
}