#include <iostream>
#include <stack>
#include <cstdlib>  // Для rand() та srand()
#include <ctime>    // Для time()
using namespace std;

int main() {
    stack<int> S;
    const int size = 10; // Максимальна місткість стека
    int sum = 0; // Змінна для підрахунку суми парних чисел
    int count = 0; // Змінна для підрахунку кількості парних чисел
    
    srand((time(0))); // Ініціалізація генератора випадкових чисел
    
    // Генерація випадкових чисел у діапазоні від 1 до 20
    for (int i = 0; i < size; i++) {
        int randomNum = 1+rand() % 20; 
        S.push(randomNum);
    }
    
    // Виведіть усі парні числа з діапазону від 10 до 20 та обчисліть їх середнє значення
    cout << "Елементи стека (випадкові числа): " << endl;
    while (!S.empty())
    {
        int num = S.top(); // Отримати верхній елемент
        S.pop(); // Видалити верхній елемент
        
        // Вивести число
        cout << num << " ";
        
        // Перевірка на парність та діапазон
        if (num >= 10 && num <= 20 && num % 2 == 0)
        {
            sum += num; // Додати до суми
            count++; // Збільшити лічильник парних чисел
        }
    }
    cout << endl; // Перехід на новий рядок після виведення чисел
    
    // Обчислення та виведення середнього значення парних чисел
    if (count > 0) {
        cout << "Середнє значення парних чисел: " << double(sum) / count << endl;
    } else {
        cout << "Парних чисел не знайдено." << endl;
    }
    
    return 0;
}